//1. Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.
// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

let number = Number(prompt("Введіть число"));
if (number === 10) {
  alert("Вірно");
} else {
  alert("Невірно");
}

//2. У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"
// const min = Math.floor(Math.random() * (59 - 0) + 0);

const min = Math.floor(Math.random() * (59 - 0) + 0);
if (min < 15) {
  alert(`${min} входить в першу чверть`);
} else if (min < 30) {
  alert(`${min} входить в другу чверть`);
} else if (min < 45) {
  alert(`${min} входить в третю чверть`);
} else {
  alert(`${min} входить в четверту чверть`);
}

//3. Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

let num = Number(prompt("Введіть число від 1 до 4"));
let results = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
switch (num) {
  case 1:
    results = 'зима';
        break;
      case 2:
    results = 'весна';
        break;
      case 3:
    results = 'літо';
        break;
      case 4:
    results = 'осінь';
        break;
    default:
        //в умові сказано що цей блок має бути але він тут не потрібен
}
console.log(result);

// 4. Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

let minutes = Number(prompt('Введіть кількість хвилин'));
let min = minutes % 60;
let hour = parseInt(minutes / 60);
let result = "";
if (minutes === 0) {
    result = "00:00";
}
if (hour === 0) {
    result = "00:";
} else if (hour < 10) {
    result = result + "0" + hour + ":";
} else {
    result = result + hour + ":";
}
if (min === 0 && minutes !== 0) {
    result = result + "00";
} else if (minutes < 10 && minutes !== 0) {
    result = result + "0" + min;
} else {
    result = result + min;
}

console.log(result);

// VERSION 2

// 4. Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.

let minutesTwo = parseInt(prompt('Введіть кількість хвилин'));
let hours = Math.floor(minutes / 60);
let otherMinutes = minutes % 60;
let formatTime = String(hours).padStart(2, '0') + ":" + String(otherMinutes).padStart(2, "0");
console.log(formatTime);

// 5. Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера
// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"
// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

let login = prompt('Введіть логін');
console.log(login);
if (login === "Адмін") {
    let password = prompt('Введіть пароль');
    if (password === "Я головний") {
          alert("Добрий день!");
    } else {
        alert("Невірний пароль!");
    }
} else if (login === "" || login === null) {
    alert("Скасовано");
} else {
    alert("Я вас не знаю");
}

//6.  Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

let i = 0;
while (i <= 20) {
    console.log(i);
    i++;
}

//7.  Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

function getNumbers(min, max) {
    let sum = 0;
    for (let i = max; i >= min; i--){
        if (i % 2 === 0) {
            sum += i;
        }
    }
    return sum;
}

//8. Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

function min(a, b) {
    if (isNaN(a) || isNaN(b)) {
        return 'Not a number!';
    } else {
        return Math.min(a, b);
    }
}
console.log(min(70, 10));

//9. Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

function isAdult(age) {
    if (age >= 18) {
       return true;
    } else {
        confirm('Підтвердіть що Вам виповнилося 18');
        return false;
    }
}
 console.log(isAdult(1));

//10. Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

function fizzBuzz(num) {
  for (let i = 1; i <= num; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
      console.log("fizzbuzz");
    } else if (i % 5 === 0) {
      console.log("buzz");
    } else if (i % 3 === 0) {
      console.log("fizz");
    }
  }
}
fizzBuzz(15);
